[
{
    "authors": "Frédérique Rey, Stefan Schorch and Sophie Robert-Hayek",
    "title": "Urtext, Archetype, Fluidity or Textual Convergence. The Quest for the Texts of the Hebrew Bible (Contributions to Biblical Exegesis & Theology)",
    "venue": "Leuven: Peeters. To be published in 2024.",
    "year": 2024,
    "category": "Collective volume"
  },  
    {
        "title": "Predicting Data Placement for HPC applications using File Lifecycles",
        "authors": "Adrian Khelili, Sophie Robert-Hayek, Soraya Zertal",
        "venue": "Submitted to the journal of Engineering of Artificial Intelligence",
        "year": 2024,
        "category": "Journal (submitted)"
    },
    {
        "title": "EVADyR: a new dynamic resampling algorithm for auto-tuning noisy High Performance Computing systems",
        "authors": "Sophie Robert-Hayek, Soraya Zertal, Philippe Couvée", 
        "venue": "Submitted to the journal of Computational Science",
        "year": 2024,
        "category": "Journal (submitted)"
    },
    {
        "authors": "Adrian Khelili, Sophie Robert, Soraya Zertal",
        "title": "FiLiP: A File Lifecycle-based Profiler for hierarchical storage",
        "venue": "Infocommunications Journal, Volume 14, pp. 26-33, DOI: 10.36244/ICJ.2022.4.4",
        "year": 2023,
        "category": "Journal"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal, Grégory Vaumourin, Philippe Couvée",
        "title": "A comparative study of black-box optimization heuristics for online tuning of High Performance Computing I/O accelerators",
        "venue": "Concurrency and Computation: Practice and Experience, Volume 33, Issue 16, DOI: 10.1002/cpe.6274",
        "year": 2021,
        "category": "Journal"

      },
      {
        "authors": "Richard Sartori, Emmanuel Jeannot, Sophie Robert-Hayek",
        "title": "Application-Agnostic Auto-tuning of Open MPI Collectives using Bayesian Optimization",
        "venue": "Accepted at IPDPS'24",
        "year": "2024",
        "category": "Proceedings"
      },
      {
        "authors": "Adrian Khelili, Sophie Robert, Soraya Zertal",
        "title": "Pattern Matching to improve Accuracy and Efficiency of File Lifecycles Forecasting",
        "venue": "14th International Conference on Intelligent Systems: Theories and Applications, SITA 2023, Casablanca, Morocco, November 22-23, 2023, IEEE",
        "year": 2023,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Jacques Istas, Frédérique Rey",
        "title": "Unraveling the Synoptic puzzle: stylometric insights into Luke's potential use of Matthew",
        "venue": "4th Conference On Computational Humanities Research (CHR), Paris, France",
        "year": 2023,
        "category": "Proceedings"
      },
      {
        "authors": "Adrian Khelili, Sophie Robert, Soraya Zertal",
        "title": "Forecasting file lifecycles for intelligent data placement in hierarchical storage",
        "venue": "35th IEEE International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD), Brasil, 2023",
        "year": 2023,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal, Philippe Couvée",
        "title": "EVADyR: a new dynamic resampling algorithm for optimizing noisy expensive systems",
        "venue": "9th International Conference on Metaheuristics and Nature Inspired Computing, Morrocco, 2023. Will be included in CCIS",
        "year": 2023,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal, Philippe Couvée",
        "title": "SHAMan: an auto-tuning framework for the optimization of expensive and noisy systems",
        "venue": "Optimization and Learning. OLA 2022. Communications in Computer and Information Science, vol 1684. Springer, Cham. DOI: 10.1007/978-3-031-22039-5_8",
        "year": 2022,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal, Lionel Vincent and Philippe Couvée",
        "title": "Record linkage for auto-tuning of High Performance Computing systems",
        "venue": "Advances in Model and Data Engineering in the Digitalization Era, MEDI 2021, Volume 1481, Chapter 11, pp. 138-151, DOI:10.1007/978-3-030-87657-9_11",
        "year": 2021,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal and Grégory Vaumourin",
        "title": "Using genetic algorithms for noisy systems' auto-tuning: an application to the case of burst buffers",
        "venue": "Presented at the 2020 International Conference on High Performance Computing & Simulation (HPCS'20), Online (Covid)",
        "year": 2020,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal and Philippe Couvée",
        "title": "SHAMan: a flexible framework for auto-tuning HPC systems",
        "venue": "Modelling, Analysis, and Simulation of Computer and Telecommunication Systems - 28th International Symposium, MASCOTS 2020, in Revised Selected Papers, pp. 147–158, DOI: 10.1007/978-3-030-68110-4_10",
        "year": 2020,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal and Gaël Goret",
        "title": "SHAMan: an intelligent framework for auto-tuning of I/O accelerators",
        "venue": "SITA'20: Proceedings of the 13th International Conference on Intelligent Systems: Theories and Applications, Article 31, pages 1–6, DOI: 10.1145/3419604.3419775",
        "year": 2020,
        "category": "Proceedings"
      },
      {
        "authors": "Sophie Robert, Soraya Zertal and Gaël Goret",
        "title": "Auto-tuning of I/O accelerators using black-box optimization",
        "venue": "Presented at the 2019 International Conference on High Performance Computing & Simulation (HPCS'19), Dublin, DOI: 10.1109/HPCS48598.2019.9188173",
        "year": 2019,
        "category": "Proceedings"
      },
        {
            "title": "An adaptive resampling strategy for auto-tuning of noisy HPC systems",
            "authors": "Sophie Robert, Soraya Zertal and Grégory Vaumourin",
            "category": "Patent",
            "patent_number": "EP20306185.8",
            "year": 2020
          },
          {
            "title": "Method for optimizing execution on high-performance computing workflows",
            "authors": "Philippe Couvée, Salim Mimouni, Sophie Robert, Lionel Vincent",
            "category": "Patent",
            "patent_number": "EP20306242.7",
            "year": 2020
          },
          {
            "title": "Méthode de réduction de l'influence du bruit dans l'inférence des paramètres du contexte d'execution d'applications HPC",
            "authors": "Sophie Robert, Soraya Zertal and Gaël Goret",
            "category": "Patent",
            "patent_number": "FR1907135, EU20182708.6, US16/912,802",
            "year": 2019
          }
      
]